export const products = [
    {
        id: 1,
        name: "درگاه پرداخت ارزهای دیجیتال",
        description: "از جمله نیازهای موجود در ایران سیستم جامع و بدون نقص پرداخت ارزهای دیجیتال برای ارائه به صنایع نرم افزار می باشد.به گونه ای که صاحبان صنایع نرم افزار بتوانند از این سیستم جهت پرداخت های پول مجازی در نرم افزار خود استفاده کنند. در حال حاضر ما موفق به ایجاد نرم افزار پرداخت در بلاکچین شده ایم و در حال تجاری سازی آن می باشیم.",
        image: "/src/assets/THE-Digital-currency.webp",
    },
    {
        id: 2,
        name: "سامانه مدیریت رستوران ها و کافه",
        description: "در این سامانه که در حال حاضر مشغول فعالیت می باشد ، مجموعه های مختلفی از جمله رستوران ها و کافه ها می توانند منوی دیجیتال خود را ایجاد کنند و درست پس از لحظه ثبت نام کیو آر خود را دانلود کنند و روی میز قرار دهند.تمام این خدمات به صورت رایگان ارائه می شود.در پلن های غیر رایگان ثبت سفارش و پرداخت توسط مشتریان میتواند انجام شود و در پلن های آینده حسابداری نیز افزوده خواهد شد.",
        image: "/src/assets/2-3.jpg",
    },
    {
        id: 3,
        name: "فایروال اختصاصی",
        description: "اهمیت امنیت روز به روز بیشتر شده و شرکت ها همواره نگرانی خود را بابت امنیت اطلاعات خود ابراز میکنند.با توجه به اینکه بسیاری از فایروال های موجود با هزینه های بالا تهیه میشوند و بسیاری از آن ها به دلیل تحریم ها برای ایران محدود میشوند پای پی در تلاش برای ایجاد یک فایروال بومی تحت سیستم عامل لینوکس برای سرورها می باشد",
        image: "/src/assets/fire.webp",
    },

    {
        id: 4,
        name: "سامانه کنترل از راه دور اشیا",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 5,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 6,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 7,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 8,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 9,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },
    {
        id: 10,
        name: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ",
        description: "طبق پیش بینی ها تا سال 2025 حدود 25 میلیارد شی به اینترنت متصل خواهد شد و از راه دور کنترل خواهند شد.ارزش سهامی که این تکنولوژی ایجاد میکند از تمامی صنایع بیشتر خواهد شد.تیم نرم افزاری و سخت افزاری ما سعی دارد با ارائه سامانه ای انعطاف پذیر قابلیت اتصال گونه های بسیاری از اشیا به وب را در ایران ایجاد کند.تولید کنندگان اشیا الکترونیکی میتوانند با استفاده از این سامانه محصولات خود را به نت متصل کنند.از چالش های مهم ما در این پروژه رمز نگاری اطلاعات و برقراری امنیت در مسیر سرور و اشیا می باشد.",
        image: "/src/assets/rahdoor.webp",
    },

];

export const members = [
    {
        id: 1,
        name: "هانما باکی",
        job: "واحد پشتیبانی",
        image: "/src/assets/hanmabaki copy.webp",
    },
    {
        id: 2,
        name: "مانکی دی لوفی",
        job: "واحد مدیریتی",
        image: "/src/assets/luffy copy.webp",
    },
    {
        id: 3,
        name: "اوزوماکی ناروتو",
        job: "واحد آموزشی",
        image: "/src/assets/naruto copy.webp",
    },
    {
        id: 4,
        name: "کروساکی ایچیگو",
        job: "واحد آموزشی",
        image: "/src/assets/ichigo copy.webp",
    },
    {
        id: 5,
        name: "تانجیرو",
        job: "واحد طراحی",
        image: "/src/assets/tanjiro copy.webp",
    },
    {
        id: 6,
        name: "کانکــــــــی",
        job: "واحد طراحی",
        image: "/src/assets/kaneki.webp",
    },
    {
        id: 7,
        name: "گـــــــــــوکو",
        job: "واحد مدیریتی",
        image: "/src/assets/Goku copy.webp",
    },
    {
        id: 8,
        name: "مادارا اوچیها",
        job: "واحد آموزشی",
        image: "/src/assets/madara copy.webp",
    },
]

export const templates = [
    {
        id: 1,
        image: "/src/assets/d1 copy.webp",
        name: "رونیو",
    },
    {
        id: 2,
        image: "/src/assets/d2 copy.webp",
        name: "اسموشر",
    },
    {
        id: 3,
        image: "/src/assets/d3 copy.webp",
        name: "فایلیتو",
    },
    {
        id: 4,
        image: "/src/assets/d4 copy.webp",
        name: "پیکسرو",
    },
]


export const security = [
    {
        id: 1,
        image: "/src/assets/siber1 copy.webp",
        name: "کانورو",
    },
    {
        id: 2,
        image: "/src/assets/siber2 copy.webp",
        name: "سیشیون",
    },
    {
        id: 3,
        image: "/src/assets/siber3 copy.webp",
        name: "هشینگ",
    },
    {
        id: 4,
        image: "/src/assets/siber4 copy.webp",
        name: "بلکسس",
    },
]



export const telegram = [
    {
      id: 1,
      image: "/src/assets/bot1 copy.webp",
      name: "بینگو",
      telegramUrl: "https://t.me/bingo_bot",
    },
    {
      id: 2,
      image: "/src/assets/bot2 copy.webp",
      name: "دولینگو",
      telegramUrl: "https://t.me/dolingo_bot",
    },
    {
      id: 3,
      image: "/src/assets/bot3 copy.webp",
      name: "سیتاروس",
      telegramUrl: "https://t.me/sitarus_bot",
    },
    {
      id: 4,
      image: "/src/assets/bot4 copy.webp",
      name: "پیکسار",
      telegramUrl: "https://t.me/pixar_bot",
    },
  ];


export const hunter = [
    {
        id: 1,
        name: "بینگو",
        desc_blur: "سفارش های شکار این سایت",
        name_state: "وضعیت",
        state: "نیازمند اطلاعات بیشتر",
        name_id: "هانما باکی",
        name_date: "تاریخ ثبت",
        name_date_update: "به روزرسانی",
        date: "12 ,آبان, 1402",
        date_update: "03 , آذر, 1403",
        hunter: "شکارچی",
        isActive: false,
    },
    {
        id: 2,
        name: "دولینگو",
        desc_blur: "سفارش های شکار این سایت",
        name_state: "وضعیت",
        state: "نیازمند اطلاعات بیشتر",
        name_id: "مانکی دی لوفی",
        name_date: "تاریخ ثبت",
        name_date_update: "به روزرسانی",
        date: "12 ,آبان, 1402",
        date_update: "03 , آذر, 1403",
        hunter: "شکارچی",
        isActive: false,
    },
    {
        id: 3,
        name: "سیتاروس",
        desc_blur: "سفارش های شکار این سایت",
        name_state: "وضعیت",
        state: "نیازمند اطلاعات بیشتر",
        name_id: "اوزوماکی ناروتو",
        name_date: "تاریخ ثبت",
        name_date_update: "به روزرسانی",
        date: "12 ,آبان, 1402",
        date_update: "03 , آذر, 1403",
        hunter: "شکارچی",
        isActive: false,
    },
    {
        id: 4,
        name: "پیکسار",
        desc_blur: "سفارش های شکار این سایت",
        name_state: "وضعیت",
        state: "نیازمند اطلاعات بیشتر",
        name_id: "کروساکی ایچیگو",
        name_date: "تاریخ ثبت",
        name_date_update: "به روزرسانی",
        date: "12 ,آبان, 1402",
        date_update: "03 , آذر, 1403",
        hunter: "شکارچی",
        isActive: false,
    },



]

export const gallery =[{
    id : 1,
    image : '/src/assets/TeamCarousel/images.jpg'
},
{
    id : 2,
    image : '/src/assets/TeamCarousel/Untitled.jpg'
},
{
    id : 3,
    image : '/src/assets/TeamCarousel/desktop-wallpaper-juno-beach-pie.jpg'
},
{
    id : 4,
    image : '/src/assets/TeamCarousel/98-983718_dream-summer-beautiful.jpg'
}
]